In [45]:
#michael is sus

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats as stat

In [46]:
company_tweet = pd.read_csv('Data/Tweets/Company_Tweet.csv')
tweet = pd.read_csv('Data/Tweets/Tweet.csv')
company = pd.read_csv('Data/Tweets/Company.csv')
company_value = pd.read_csv('Data/CompanyStocks/CompanyValues.csv')

In [47]:
def quick_analysis(df):
    print("Data info:")
    print(df.info())
    print("-------------****----------------\n\nData Types:")
    print(df.dtypes)
    print("-------------****----------------\n\nRows and Columns:")
    print(df.shape)
    print("-------------****----------------\n\nColumn names:")
    print(df.columns)
    print("-------------****----------------\n\nNull Values:")
    print(df.apply(lambda x: sum(x.isnull()) / len(df)))
    print("-------------****----------------\n\nUnique values:")
    print(df.nunique())
    print("-------------****----------------\n\nDescribes:")
    print(df.describe())
    print("-------------****----------------\n\nHead:")
    print(df.head())

In [48]:
#Do a sentiment analysis on the tweets

quick_analysis(tweet)

Data info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3717964 entries, 0 to 3717963
Data columns (total 7 columns):
 #   Column       Dtype
---  ------       -----
 0   tweet_id     int64
 1   writer       object
 2   post_date    int64
 3   body         object
 4   comment_num  int64
 5   retweet_num  int64
 6   like_num     int64
dtypes: int64(5), object(2)
memory usage: 198.6+ MB
None
-------------****----------------

Data Types:
tweet_id        int64
writer         object
post_date       int64
body           object
comment_num     int64
retweet_num     int64
like_num        int64
dtype: object
-------------****----------------

Rows and Columns:
(3717964, 7)
-------------****----------------

Column names:
Index(['tweet_id', 'writer', 'post_date', 'body', 'comment_num', 'retweet_num',
       'like_num'],
      dtype='object')
-------------****----------------

Null Values:
tweet_id       0.000000
writer         0.012715
post_date      0.000000
body           0.000000
comment_num    0.000000
retweet_num    0.000000
like_num       0.000000
dtype: float64
-------------****----------------

Unique values:
tweet_id       3717964
writer          140131
post_date      3421363
body           3326194
comment_num        191
retweet_num        509
like_num           783
dtype: int64
-------------****----------------

Describes:
           tweet_id     post_date   comment_num   retweet_num      like_num
count  3.717964e+06  3.717964e+06  3.717964e+06  3.717964e+06  3.717964e+06
mean   8.797444e+17  1.498582e+09  3.123642e-01  6.214807e-01  2.219982e+00
std    1.924039e+17  4.587266e+07  1.966064e+00  7.009571e+00  1.429093e+01
min    5.504415e+17  1.420070e+09  0.000000e+00  0.000000e+00  0.000000e+00
25%    7.169886e+17  1.459778e+09  0.000000e+00  0.000000e+00  0.000000e+00
50%    8.743180e+17  1.497289e+09  0.000000e+00  0.000000e+00  0.000000e+00
75%    1.050771e+18  1.539358e+09  0.000000e+00  0.000000e+00  1.000000e+00
max    1.212160e+18  1.577837e+09  6.310000e+02  9.990000e+02  9.990000e+02
-------------****----------------

Head:
             tweet_id           writer   post_date  \
0  550441509175443456  VisualStockRSRC  1420070457
1  550441672312512512      KeralaGuy77  1420070496
2  550441732014223360      DozenStocks  1420070510
3  550442977802207232     ShowDreamCar  1420070807
4  550443807834402816     i_Know_First  1420071005

                                                body  comment_num  \
0  lx21 made $10,008  on $AAPL -Check it out! htt...            0
1  Insanity of today weirdo massive selling. $aap...            0
2  S&P100 #Stocks Performance $HD $LOW $SBUX $TGT...            0
3  $GM $TSLA: Volkswagen Pushes 2014 Record Recal...            0
4  Swing Trading: Up To 8.91% Return In 14 Days h...            0

   retweet_num  like_num
0            0         1
1            0         0
2            0         0
3            0         1
4            0         1

In [49]:
tweet = tweet.dropna()

In [50]:
tweet.isna().sum().sum()

0

In [51]:
tweet.head()

,tweet_id,writer,post_date,body,comment_num,retweet_num,like_num
0,550441509175443456,VisualStockRSRC,1420070457,"lx21 made $10,008 on $AAPL -Check it out! htt...",0,0,1
1,550441672312512512,KeralaGuy77,1420070496,Insanity of today weirdo massive selling. $aap...,0,0,0
2,550441732014223360,DozenStocks,1420070510,S&P100 #Stocks Performance $HD $LOW $SBUX $TGT...,0,0,0
3,550442977802207232,ShowDreamCar,1420070807,$GM $TSLA: Volkswagen Pushes 2014 Record Recal...,0,0,1
4,550443807834402816,i_Know_First,1420071005,Swing Trading: Up To 8.91% Return In 14 Days h...,0,0,1

In [52]:
 company_tweet.head()

             tweet_id ticker_symbol
0  550803612197457920          AAPL
1  550803610825928706          AAPL
2  550803225113157632          AAPL
3  550802957370159104          AAPL
4  550802855129382912          AAPL

In [53]:
company_value.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
0,AAPL,2020-05-29,317.94,38399530,319.25,321.15,316.47
1,AAPL,2020-05-28,318.25,33449100,316.77,323.44,315.63
2,AAPL,2020-05-27,318.11,28236270,316.14,318.71,313.09
3,AAPL,2020-05-26,316.73,31380450,323.50,324.24,316.50
4,AAPL,2020-05-22,318.89,20450750,315.77,319.23,315.35

In [54]:
company.head()

  ticker_symbol company_name
0          AAPL        apple
1          GOOG   Google Inc
2         GOOGL   Google Inc
3          AMZN   Amazon.com
4          TSLA    Tesla Inc

In [55]:
#merge company tweets and tweets on id
tweet_df = pd.merge(company_tweet , tweet , on="tweet_id", how= "inner")

In [56]:
#create variable 'total_engagement'
tweet_df["total_engangement"] = tweet_df["comment_num"] + tweet_df["retweet_num"] + tweet_df["like_num"]
#remove tweets below certain engagement
engagement_threshold = 40
tweet_df = tweet_df[tweet_df["total_engangement"] > engagement_threshold]
tweet_df.head()
print('tweet count: ', tweet_df.size)

tweet count:  485118

In [57]:
#convert original time on tweet_df to date time
tweet_df['post_date'] = pd.to_datetime(tweet_df['post_date'], unit='s')
tweet_df['day_date'] = pd.to_datetime(tweet_df['post_date'].apply(lambda date: date.date()))

In [58]:
#order chronilogically
tweet_df = tweet_df.sort_values(by="day_date")

In [59]:
tweet_df.head()

,tweet_id,ticker_symbol,writer,post_date,body,comment_num,retweet_num,like_num,total_engangement,day_date
40,550781053137616896,AAPL,CNBC,2015-01-01 22:30:10,This is Wall Street's top pick in 2015. Hint: ...,5,37,22,64,2015-01-01
47,550779709840445441,AAPL,WSJ,2015-01-01 22:24:50,"See how tech companies like Apple, Twitter and...",15,223,109,347,2015-01-01
239,550650451948212224,AAPL,greatspoke,2015-01-01 13:51:12,Top Stock Analyst Releases Report on Top Stock...,0,431,2,433,2015-01-01
240,550650235404701697,AAPL,greatspoke,2015-01-01 13:50:21,Analyst Report on Top Stock Market Options for...,0,430,3,433,2015-01-01
241,550650235404701697,AMZN,greatspoke,2015-01-01 13:50:21,Analyst Report on Top Stock Market Options for...,0,430,3,433,2015-01-01

In [60]:
#convert time value on company stock data to date time
stock_df = company_value
stock_df['day_date']  = pd.to_datetime(stock_df['day_date'])
stock_df.sample(5)

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
11564,MSFT,2019-09-03,136.04,18880770,136.61,137.20,135.70
2948,AAPL,2018-10-21,219.31,32874330,218.06,221.26,217.43
9214,GOOGL,2019-08-24,1153.58,1813141,1185.17,1195.67,1150.00
17040,TSLA,2015-09-13,250.24,2346802,247.64,250.24,244.73
5055,AMZN,2012-07-30,236.09,3736079,237.00,240.74,234.07

In [61]:
#drop un-needed features
tweet_df = tweet_df.drop(['tweet_id', 'post_date', 'comment_num', 'retweet_num', 'like_num'], axis=1)

In [62]:
#remove any stock data that is outside of the tweet data
start_day = min(tweet_df['day_date'])
print(f"Start day: {start_day}")

end_day = max(tweet_df['day_date'])
print(f"End day: {end_day}")

Start day: 2015-01-01 00:00:00
End day: 2019-12-31 00:00:00

In [63]:
stock_df = stock_df[(stock_df['day_date'] >= start_day) & (stock_df['day_date'] <= end_day)]

In [64]:
#sort stock data chronilogically
stock_df = stock_df.sort_values(by="day_date")
stock_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
2517,AAPL,2015-01-01,110.38,41304780,112.82,113.13,110.21
10810,GOOG,2015-01-01,526.40,1367110,531.25,532.60,525.80
8687,GOOGL,2015-01-01,530.66,1235889,537.74,538.40,530.20
16960,TSLA,2015-01-01,222.41,2392947,223.09,225.68,222.25
5602,AMZN,2015-01-01,310.35,2048676,311.55,312.98,310.01

In [65]:
tweet_df.head()

,ticker_symbol,writer,body,total_engangement,day_date
40,AAPL,CNBC,This is Wall Street's top pick in 2015. Hint: ...,64,2015-01-01
47,AAPL,WSJ,"See how tech companies like Apple, Twitter and...",347,2015-01-01
239,AAPL,greatspoke,Top Stock Analyst Releases Report on Top Stock...,433,2015-01-01
240,AAPL,greatspoke,Analyst Report on Top Stock Market Options for...,433,2015-01-01
241,AMZN,greatspoke,Analyst Report on Top Stock Market Options for...,433,2015-01-01

In [66]:
APPL_df = stock_df.loc[stock_df['ticker_symbol'] == 'AAPL']

GOOG_df = stock_df.loc[stock_df['ticker_symbol'] == 'GOOG']
GOOGL_df = stock_df.loc[stock_df['ticker_symbol'] == 'GOOGL']


TSLA_df = stock_df.loc[stock_df['ticker_symbol'] == 'TSLA']
AMZN_df = stock_df.loc[stock_df['ticker_symbol'] == 'AMZN']
MSFT_df = stock_df.loc[stock_df['ticker_symbol'] == 'MSFT']

In [67]:
APPL_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
2517,AAPL,2015-01-01,110.38,41304780,112.82,113.13,110.21
1360,AAPL,2015-01-02,109.33,53143770,111.39,111.44,107.35
2518,AAPL,2015-01-03,109.33,53143770,111.39,111.44,107.35
2519,AAPL,2015-01-04,109.33,53143770,111.39,111.44,107.35
1359,AAPL,2015-01-05,106.25,64210880,108.29,108.65,105.41

In [68]:
GOOG_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
10810,GOOG,2015-01-01,526.40,1367110,531.25,532.60,525.80
10615,GOOG,2015-01-02,524.81,1444809,529.01,531.27,524.10
10811,GOOG,2015-01-03,524.81,1444809,529.01,531.27,524.10
10812,GOOG,2015-01-04,524.81,1444809,529.01,531.27,524.10
10614,GOOG,2015-01-05,513.87,2049303,523.26,524.33,513.06

In [69]:
#there are two types of google stocks, one has voting power in the company while the other doesnt
GOOGL_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
8687,GOOGL,2015-01-01,530.66,1235889,537.74,538.4000,530.20
7530,GOOGL,2015-01-02,529.55,1325271,532.60,535.8000,527.88
8688,GOOGL,2015-01-03,529.55,1325271,532.60,535.8000,527.88
8689,GOOGL,2015-01-04,529.55,1325271,532.60,535.8000,527.88
7529,GOOGL,2015-01-05,519.46,2054120,527.15,527.9899,517.75

In [70]:
TSLA_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
16960,TSLA,2015-01-01,222.41,2392947,223.09,225.68,222.2500
15823,TSLA,2015-01-02,219.31,4753239,222.87,223.25,213.2600
16961,TSLA,2015-01-03,219.31,4753239,222.87,223.25,213.2600
16962,TSLA,2015-01-04,219.31,4753239,222.87,223.25,213.2600
15822,TSLA,2015-01-05,210.09,5355485,214.55,216.50,207.1626

In [71]:
AMZN_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
5602,AMZN,2015-01-01,310.35,2048676,311.55,312.98,310.0100
4445,AMZN,2015-01-02,308.52,2785167,312.58,314.75,306.9601
5603,AMZN,2015-01-03,308.52,2785167,312.58,314.75,306.9601
5604,AMZN,2015-01-04,308.52,2785167,312.58,314.75,306.9601
4444,AMZN,2015-01-05,302.19,2768215,307.01,308.38,300.8500

In [72]:
MSFT_df.head()

,ticker_symbol,day_date,close_value,volume,open_value,high_value,low_value
13895,MSFT,2015-01-01,46.450,21551090,46.73,47.44,46.45
12738,MSFT,2015-01-02,46.760,27843560,46.66,47.42,46.54
13896,MSFT,2015-01-03,46.760,27843560,46.66,47.42,46.54
13897,MSFT,2015-01-04,46.760,27843560,46.66,47.42,46.54
12737,MSFT,2015-01-05,46.325,39667400,46.37,46.73,46.25

In [73]:
APPL_tweet = tweet_df.loc[tweet_df['ticker_symbol'] == 'AAPL']

In [74]:
APPL_tweet.head()

,ticker_symbol,writer,body,total_engangement,day_date
40,AAPL,CNBC,This is Wall Street's top pick in 2015. Hint: ...,64,2015-01-01
47,AAPL,WSJ,"See how tech companies like Apple, Twitter and...",347,2015-01-01
239,AAPL,greatspoke,Top Stock Analyst Releases Report on Top Stock...,433,2015-01-01
240,AAPL,greatspoke,Analyst Report on Top Stock Market Options for...,433,2015-01-01
1157,AAPL,philstockworld,Trading Trends for 2015 from http://PhilStockW...,975,2015-01-02

In [75]:
pip install nltk

Requirement already satisfied: nltk in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (3.7)
Requirement already satisfied: tqdm in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from nltk) (4.64.0)
Requirement already satisfied: joblib in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from nltk) (1.1.0)
Requirement already satisfied: regex>=2021.8.3 in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from nltk) (2022.6.2)
Requirement already satisfied: click in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from nltk) (8.0.3)
Requirement already satisfied: colorama in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from click->nltk) (0.4.4)
Note: you may need to restart the kernel to use updated packages.

In [76]:
import nltk                             
# from nltk.corpus import twitter_samples                            
# from nltk.corpus import stopwords 
# from nltk.stem import PorterStemmer
# from nltk.tokenize import TweetTokenizer  

import random  
import re                     
import string

In [77]:
def remove_special_character(tweet):
#     print(tweet)
    # remove the old style retweet text "RT"
    tweet = re.sub(r'^RT[\s]+', '', tweet)

    # remove hyperlinks
    tweet = re.sub(r'https?:\/\/.*[\r\n]*', '', tweet)

    # remove hashtags. only removing the hash # sign from the word
    tweet = re.sub(r'#', '', tweet)

    # remove single numeric terms in the tweet. 
    tweet = re.sub(r'[0-9]', '', tweet)
    
    return tweet

In [78]:
tweet_df["body"] = tweet_df["body"].apply(lambda tweet: remove_special_character(tweet))
tweet_df["body"] = tweet_df["body"].str.lower()
tweet_df.sample(5)

# ?? why is the body text so fucked up ??

,ticker_symbol,writer,body,total_engangement,day_date
4032345,TSLA,Alpsoy66,mr cramer has simply crossed the line by publi...,57,2019-03-21
4054692,TSLA,Saba_Capital,$ tax credit is back $tsla $gm,93,2019-04-10
3848905,TSLA,TwainsMustache,david faber on james murdoch joining $tsla boa...,42,2018-09-18
3774215,TSLA,MarkYusko,redisthenewblack in the newabnormal$tsla equit...,41,2018-08-02
923028,AAPL,WSJbusiness,apple cuts ceo tim cook’s pay after it misses ...,42,2017-01-06

In [79]:
pip install vaderSentiment

Requirement already satisfied: vaderSentiment in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (3.3.2)
Requirement already satisfied: requests in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from vaderSentiment) (2.27.1)
Requirement already satisfied: idna<4,>=2.5 in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from requests->vaderSentiment) (3.3)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from requests->vaderSentiment) (1.26.8)
Requirement already satisfied: charset-normalizer~=2.0.0 in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from requests->vaderSentiment) (2.0.4)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\michael\anaconda3\envs\tensorflow-session\lib\site-packages (from requests->vaderSentiment) (2022.6.15)
Note: you may need to restart the kernel to use updated packages.

In [80]:
from vaderSentiment.vaderSentiment import SentimentIntensityAnalyzer
vanderSentimentAnalyzer = SentimentIntensityAnalyzer()

In [81]:
def getVanderScore(tweet):    
    vs = vanderSentimentAnalyzer.polarity_scores(tweet)
    score = vs['compound']
    return score

In [82]:
tweet_df['vander_score'] = tweet_df['body'].apply(lambda tweet: getVanderScore(tweet))

In [83]:
tweet_df.head(15)

,ticker_symbol,writer,body,total_engangement,day_date,vander_score
40,AAPL,CNBC,this is wall street's top pick in . hint: it's...,64,2015-01-01,0.2023
47,AAPL,WSJ,"see how tech companies like apple, twitter and...",347,2015-01-01,0.3612
239,AAPL,greatspoke,top stock analyst releases report on top stock...,433,2015-01-01,0.3818
240,AAPL,greatspoke,analyst report on top stock market options for...,433,2015-01-01,0.2023
241,AMZN,greatspoke,analyst report on top stock market options for...,433,2015-01-01,0.2023
2516034,AMZN,WSJ,jeff bezos lost $. billion in amazon's worst y...,217,2015-01-01,-0.7506
2516062,AMZN,WSJ,jeff bezos lost $. billion in amazon's worst y...,187,2015-01-01,-0.7506
1157,AAPL,philstockworld,trading trends for from,975,2015-01-02,0.0000
1255,AAPL,greatspoke,top stock analyst releases report on top stock...,350,2015-01-02,0.3818
1256,AAPL,greatspoke,analyst report on top stock market options for...,350,2015-01-02,0.2023
1257,AMZN,greatspoke,analyst report on top stock market options for...,350,2015-01-02,0.2023
2339,AAPL,WSJ,"see how tech companies like apple, twitter and...",342,2015-01-04,0.3612
1850635,GOOG,WSJ,google now controls or occupies a strip of man...,389,2015-01-04,0.0000
2102,GOOGL,CNBC,this is wall street's top pick in (and it's n...,55,2015-01-04,0.2023
2101,AAPL,CNBC,this is wall street's top pick in (and it's n...,55,2015-01-04,0.2023

In [84]:
quick_analysis(tweet_df)

Data info:
<class 'pandas.core.frame.DataFrame'>
Int64Index: 53902 entries, 40 to 4280481
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ticker_symbol      53902 non-null  object
 1   writer             53902 non-null  object
 2   body               53902 non-null  object
 3   total_engangement  53902 non-null  int64
 4   day_date           53902 non-null  datetime64[ns]
 5   vander_score       53902 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 2.9+ MB
None
-------------****----------------

Data Types:
ticker_symbol                object
writer                       object
body                         object
total_engangement             int64
day_date             datetime64[ns]
vander_score                float64
dtype: object
-------------****----------------

Rows and Columns:
(53902, 6)
-------------****----------------

Column names:
Index(['ticker_symbol', 'writer', 'body', 'total_engangement', 'day_date',
       'vander_score'],
      dtype='object')
-------------****----------------

Null Values:
ticker_symbol        0.0
writer               0.0
body                 0.0
total_engangement    0.0
day_date             0.0
vander_score         0.0
dtype: float64
-------------****----------------

Unique values:
ticker_symbol            6
writer                3323
body                 48524
total_engangement      977
day_date              1783
vander_score          5387
dtype: int64
-------------****----------------

Describes:
       total_engangement  vander_score
count       53902.000000  53902.000000
mean          112.919984      0.093859
std           123.964832      0.441555
min            41.000000     -0.997800
25%            52.000000     -0.117525
50%            72.000000      0.000000
75%           120.000000      0.440400
max          1703.000000      0.993400
-------------****----------------

Head:
    ticker_symbol      writer  \
40           AAPL        CNBC
47           AAPL         WSJ
239          AAPL  greatspoke
240          AAPL  greatspoke
241          AMZN  greatspoke

                                                  body  total_engangement  \
40   this is wall street's top pick in . hint: it's...                 64
47   see how tech companies like apple, twitter and...                347
239  top stock analyst releases report on top stock...                433
240  analyst report on top stock market options for...                433
241  analyst report on top stock market options for...                433

      day_date  vander_score
40  2015-01-01        0.2023
47  2015-01-01        0.3612
239 2015-01-01        0.3818
240 2015-01-01        0.2023
241 2015-01-01        0.2023

In [85]:
#create a weighted scored based off engagement and sentiment analysis score
tweet_df['summarative_score'] = tweet_df['total_engangement'] * tweet_df['vander_score'] * 0.01
tweet_df = tweet_df.drop(['total_engangement', 'vander_score'], axis=1)

In [86]:
tweet_df.sample(20)

,ticker_symbol,writer,body,day_date,summarative_score
1446170,AAPL,ReutersBiz,just in: faang stocks fall; facebook down . pe...,2018-10-10,0.119193
1804676,GOOGL,eWhispers,earnings,2019-10-26,0.000000
4045885,TSLA,tool_grinder,"new $tsla ""in-transit"" language added to st q...",2019-04-04,0.000000
1017225,TSLA,CNBCFastMoney,"$aapl, $googl, $amzn, $fb and $tsla are the fa...",2017-05-01,0.307396
2683175,AMZN,Stocktwits,holding big winners is incredibly hard.this ch...,2016-09-04,0.419496
3647417,TSLA,GerberKawasaki,at a certain point the short sellers are going...,2018-01-17,0.589030
3365316,TSLA,tim,this tweet's impact on $tsla stock rt @elonmus...,2015-03-30,0.000000
1308525,AAPL,realsheepwolf,$celz absolutely huge opportunity to get in o...,2018-04-22,0.608304
4094257,TSLA,JebKinnison,/ admitting failure would have meant $tsla fil...,2019-05-11,-0.373458
3461388,TSLA,ReutersBiz,"wall street thinks tesla is worth $, per car:",2016-05-03,0.332661
1424895,GOOGL,charliebilello,price to sales ratios...$fb: .$aapl: .$amzn: ....,2018-09-13,0.000000
2194230,GOOG,DomainMondo,amazon $amzn vs google $goog battle for smart ...,2019-01-09,0.156538
4080077,TSLA,phoennix10,$tsla - / missed in tesla q earning destructio...,2019-04-27,0.155724
3565428,TSLA,TheBubbleBubble,a record million americans have car loans:,2017-05-19,0.000000
2412969,GOOGL,Reuters,google appeals at the national company law app...,2018-04-10,-0.271645
3950546,TSLA,markbspiegel,a friend just sent me this video taken today o...,2018-12-30,0.340791
1799106,TSLA,Terri1618,mon: $cdnstu: $cmg $snap $utx $txnw: $lrcx $xl...,2019-10-20,0.000000
4155620,TSLA,vincent13031925,the next few trading days could be the last ch...,2019-07-18,0.485000
1474690,AAPL,MadMoneyOnCNBC,you all know @jimcramer's position on $aapl. b...,2018-11-07,0.287808
3828724,TSLA,c4chaos,legend has it that if you make a pilgrimage to...,2018-08-31,0.319490

In [ ]:
#sum or avg the summarative_scores for one date